// 桥梁所有点的位置
export const MeshPointObj = {
  110101: {
    X: -3050,
    Y: 0,
    Z: 32.5,
    ConStrain: 63
  },
  110102: {
    X: -2937.5,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110103: {
    X: -2825,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110104: {
    X: -2712.5,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110201: {
    X: -2600,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110202: {
    X: -2475,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110203: {
    X: -2350,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110204: {
    X: -2225,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110301: {
    X: -2100,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110302: {
    X: -1975,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110303: {
    X: -1850,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110304: {
    X: -1725,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110401: {
    X: -1600,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110402: {
    X: -1475,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110403: {
    X: -1350,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110404: {
    X: -1225,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110501: {
    X: -1100,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110502: {
    X: -975,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110503: {
    X: -850,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110504: {
    X: -725,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110601: {
    X: -600,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110602: {
    X: -450,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110603: {
    X: -300,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110604: {
    X: -150,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110701: {
    X: 0,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110702: {
    X: 150,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110703: {
    X: 300,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110704: {
    X: 450,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110801: {
    X: 600,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110802: {
    X: 725,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110803: {
    X: 850,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110804: {
    X: 975,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110901: {
    X: 1100,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110902: {
    X: 1225,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110903: {
    X: 1350,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  110904: {
    X: 1475,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  111001: {
    X: 1600,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  111002: {
    X: 1725,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  111003: {
    X: 1850,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  111004: {
    X: 1975,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  111101: {
    X: 2100,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  111102: {
    X: 2225,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  111103: {
    X: 2350,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  111104: {
    X: 2475,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  111201: {
    X: 2600,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  111202: {
    X: 2712.5,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  111203: {
    X: 2825,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  111204: {
    X: 2937.5,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  111301: {
    X: 3050,
    Y: 0,
    Z: 32.5,
    ConStrain: 63
  },
  210201: {
    X: -2600,
    Y: 0,
    Z: -484,
    ConStrain: 63
  },
  210203: {
    X: -2250,
    Y: 0,
    Z: -900,
    ConStrain: 63
  },
  210204: {
    X: -2175,
    Y: 0,
    Z: -841,
    ConStrain: 0
  },
  210301: {
    X: -2100,
    Y: 0,
    Z: -784,
    ConStrain: 0
  },
  210302: {
    X: -1975,
    Y: 0,
    Z: -693.444,
    ConStrain: 0
  },
  210303: {
    X: -1850,
    Y: 0,
    Z: -608.444,
    ConStrain: 0
  },
  210304: {
    X: -1725,
    Y: 0,
    Z: -529,
    ConStrain: 0
  },
  210401: {
    X: -1600,
    Y: 0,
    Z: -455.111,
    ConStrain: 0
  },
  210402: {
    X: -1475,
    Y: 0,
    Z: -386.778,
    ConStrain: 0
  },
  210403: {
    X: -1350,
    Y: 0,
    Z: -324,
    ConStrain: 0
  },
  210404: {
    X: -1225,
    Y: 0,
    Z: -266.778,
    ConStrain: 0
  },
  210501: {
    X: -1100,
    Y: 0,
    Z: -215.111,
    ConStrain: 0
  },
  210502: {
    X: -975,
    Y: 0,
    Z: -169,
    ConStrain: 0
  },
  210503: {
    X: -850,
    Y: 0,
    Z: -128.444,
    ConStrain: 0
  },
  210504: {
    X: -725,
    Y: 0,
    Z: -93.4444,
    ConStrain: 0
  },
  210601: {
    X: -600,
    Y: 0,
    Z: -64,
    ConStrain: 0
  },
  210602: {
    X: -450,
    Y: 0,
    Z: -36,
    ConStrain: 0
  },
  210603: {
    X: -300,
    Y: 0,
    Z: -16,
    ConStrain: 0
  },
  210604: {
    X: -150,
    Y: 0,
    Z: -4,
    ConStrain: 0
  },
  210701: {
    X: 0,
    Y: 0,
    Z: 0,
    ConStrain: 0
  },
  210702: {
    X: 150,
    Y: 0,
    Z: -4,
    ConStrain: 0
  },
  210703: {
    X: 300,
    Y: 0,
    Z: -16,
    ConStrain: 0
  },
  210704: {
    X: 450,
    Y: 0,
    Z: -36,
    ConStrain: 0
  },
  210801: {
    X: 600,
    Y: 0,
    Z: -64,
    ConStrain: 0
  },
  210802: {
    X: 725,
    Y: 0,
    Z: -93.4444,
    ConStrain: 0
  },
  210803: {
    X: 850,
    Y: 0,
    Z: -128.444,
    ConStrain: 0
  },
  210804: {
    X: 975,
    Y: 0,
    Z: -169,
    ConStrain: 0
  },
  210901: {
    X: 1100,
    Y: 0,
    Z: -215.111,
    ConStrain: 0
  },
  210902: {
    X: 1225,
    Y: 0,
    Z: -266.778,
    ConStrain: 0
  },
  210903: {
    X: 1350,
    Y: 0,
    Z: -324,
    ConStrain: 0
  },
  210904: {
    X: 1475,
    Y: 0,
    Z: -386.778,
    ConStrain: 0
  },
  211001: {
    X: 1600,
    Y: 0,
    Z: -455.111,
    ConStrain: 0
  },
  211002: {
    X: 1725,
    Y: 0,
    Z: -529,
    ConStrain: 0
  },
  211003: {
    X: 1850,
    Y: 0,
    Z: -608.444,
    ConStrain: 0
  },
  211004: {
    X: 1975,
    Y: 0,
    Z: -693.444,
    ConStrain: 0
  },
  211101: {
    X: 2100,
    Y: 0,
    Z: -784,
    ConStrain: 0
  },
  211102: {
    X: 2175,
    Y: 0,
    Z: -841,
    ConStrain: 0
  },
  211103: {
    X: 2250,
    Y: 0,
    Z: -900,
    ConStrain: 63
  },
  211201: {
    X: 2600,
    Y: 0,
    Z: -484,
    ConStrain: 63
  },
  310201: {
    X: -2600,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  310202: {
    X: -2600,
    Y: 0,
    Z: -96.625,
    ConStrain: 0
  },
  310203: {
    X: -2600,
    Y: 0,
    Z: -225.75,
    ConStrain: 0
  },
  310204: {
    X: -2600,
    Y: 0,
    Z: -354.875,
    ConStrain: 0
  },
  310301: {
    X: -2100,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  310302: {
    X: -2100,
    Y: 0,
    Z: -171.625,
    ConStrain: 0
  },
  310303: {
    X: -2100,
    Y: 0,
    Z: -375.75,
    ConStrain: 0
  },
  310304: {
    X: -2100,
    Y: 0,
    Z: -579.875,
    ConStrain: 0
  },
  310401: {
    X: -1600,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  310402: {
    X: -1600,
    Y: 0,
    Z: -89.4028,
    ConStrain: 0
  },
  310403: {
    X: -1600,
    Y: 0,
    Z: -211.306,
    ConStrain: 0
  },
  310404: {
    X: -1600,
    Y: 0,
    Z: -333.208,
    ConStrain: 0
  },
  310501: {
    X: -1100,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  310502: {
    X: -1100,
    Y: 0,
    Z: -29.4028,
    ConStrain: 0
  },
  310503: {
    X: -1100,
    Y: 0,
    Z: -91.3056,
    ConStrain: 0
  },
  310504: {
    X: -1100,
    Y: 0,
    Z: -153.208,
    ConStrain: 0
  },
  310901: {
    X: 1100,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  310902: {
    X: 1100,
    Y: 0,
    Z: -29.4028,
    ConStrain: 0
  },
  310903: {
    X: 1100,
    Y: 0,
    Z: -91.3056,
    ConStrain: 0
  },
  310904: {
    X: 1100,
    Y: 0,
    Z: -153.208,
    ConStrain: 0
  },
  311001: {
    X: 1600,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  311002: {
    X: 1600,
    Y: 0,
    Z: -89.4028,
    ConStrain: 0
  },
  311003: {
    X: 1600,
    Y: 0,
    Z: -211.306,
    ConStrain: 0
  },
  311004: {
    X: 1600,
    Y: 0,
    Z: -333.208,
    ConStrain: 0
  },
  311101: {
    X: 2100,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  311102: {
    X: 2100,
    Y: 0,
    Z: -171.625,
    ConStrain: 0
  },
  311103: {
    X: 2100,
    Y: 0,
    Z: -375.75,
    ConStrain: 0
  },
  311104: {
    X: 2100,
    Y: 0,
    Z: -579.875,
    ConStrain: 0
  },
  311201: {
    X: 2600,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  311202: {
    X: 2600,
    Y: 0,
    Z: -96.625,
    ConStrain: 0
  },
  311203: {
    X: 2600,
    Y: 0,
    Z: -225.75,
    ConStrain: 0
  },
  311204: {
    X: 2600,
    Y: 0,
    Z: -354.875,
    ConStrain: 0
  },
  410601: {
    X: -600,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  410602: {
    X: -450,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  410603: {
    X: -300,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  410604: {
    X: -150,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  410701: {
    X: 0,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  410702: {
    X: 150,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  410703: {
    X: 300,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  410704: {
    X: 450,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  },
  410801: {
    X: 600,
    Y: 0,
    Z: 32.5,
    ConStrain: 0
  }
}
